Narin-Laboratory/libudawa-esp32/src/libudawa.h
/**
 * UDAWA - Universal Digital Agriculture Watering Assistant
 * Function helper library for ESP32 based UDAWA multi-device firmware development
 * Licensed under aGPLv3
 * Researched and developed by PRITA Research Group & Narin Laboratory
 * prita.undiknas.ac.id | narin.co.id
**/

#ifndef libudawa_h
#define libudawa_h

#include <secret.h>
#include <esp32-hal-log.h>
#include <esp_int_wdt.h>
#include <esp_task_wdt.h>
#include <FS.h>
#include <SPIFFS.h>
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClientSecure.h>
#include <ArduinoJson.h>
#include <StreamUtils.h>
#include <ArduinoOTA.h>
#include <thingsboard.h>
#include "logging.h"
#include "serialLogger.h"
#include <ESP32Time.h>
#include <ESPmDNS.h>
#define DISABLE_ALL_LIBRARY_WARNINGS
#include <esp32FOTA.hpp>
#include <WiFiUdp.h>
#ifdef USE_WEB_IFACE
#include <WebServer.h>
#include <WebSocketsServer.h>
#endif

#define _TASK_TIMECRITICAL
#define _TASK_STATUS_REQUEST
#define _TASK_LTS_POINTER
#define _TASK_TIMEOUT
#define _TASK_EXPOSE_CHAIN
#define _TASK_SELF_DESTRUCT
#include <TaskScheduler.h>

#define countof(a) (sizeof(a) / sizeof(a[0]))
#define COMPILED __DATE__ " " __TIME__
#define S2_RX 16
#define S2_TX 17
#define WIFI_FALLBACK_COUNTER 3
#ifndef DOCSIZE
  #define DOCSIZE 1024
#endif

#ifndef DOCSIZE_MIN
  #define DOCSIZE_MIN 384
#endif
#define TASK_EXPIRED 120
#define INTV_wifiKeeperLoop 60 * TASK_SECOND
#define INTV_tbKeeperLoop 60 * TASK_SECOND
#define INTV_ifaceLoop 10 * TASK_MILLISECOND
#define INTV_tbLoop 10 * TASK_MILLISECOND
#define INTV_wifiOtaLoop 10 * TASK_MILLISECOND


namespace libudawa
{

const char* configFile = "/cfg.json";
const char* configFileCoMCU = "/comcu.json";
bool FLAG_IOT_SUBSCRIBE = false;
bool FLAG_IOT_INIT = false;
bool FLAG_OTA_UPDATE_INIT = false;
bool WIFI_IS_DEFAULT = false;

struct Config
{
  char hwid[16];
  char name[24];
  char model[16];
  char group[16];
  uint8_t logLev;

  char broker[48];
  uint16_t port;
  char wssid[24];
  char wpass[24];
  char dssid[24];
  char dpass[24];
  char upass[64];
  char accTkn[24];
  bool provSent;

  char provDK[24];
  char provDS[24];

  int gmtOff;

  bool fIoT;
  bool fWOTA;
  bool fIface;
  char hname[40];
  char htU[24];
  char htP[24];

  uint8_t tbDisco = 0;

  char logIP[16] = "192.168.18.255";
  uint16_t logPrt = 29514;

  #ifdef USE_WEB_IFACE
  uint8_t wsCount = 0;
  #endif
};

struct ConfigCoMCU
{
  bool fP;
  uint16_t bFr;
  bool fB;
  uint8_t pBz;
  uint8_t pLR;
  uint8_t pLG;
  uint8_t pLB;
  uint8_t lON;
};

class GCB {
  public:
    using processFn = JsonObject (*)(JsonObject &data);

    inline GCB()
      : m_name(), m_cb(NULL)                {  }

    inline GCB(const char *methodName, processFn cb)
      : m_name(methodName), m_cb(cb)        {  }

    const char  *m_name;
    processFn   m_cb;
};

class ESP32UDPLogger : public ILogHandler
{
    public:
        void log_message(const char *tag, const LogLevel level, const char *fmt, va_list args) override;
};

uint32_t micro2milli(uint32_t hi, uint32_t lo);
double round2(double value);
void reboot();
char* getDeviceId();
void cbWifiOnConnected(WiFiEvent_t event, WiFiEventInfo_t info);
void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info);
void cbWiFiOnLostIp(WiFiEvent_t event, WiFiEventInfo_t info);
void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info);
void configLoadFailSafe();
void configLoad();
void configSave();
void configReset();
void configCoMCULoadFailSafe();
void configCoMCULoad();
void configCoMCUSave();
void configCoMCUReset();
bool loadFile(const char* filePath, char* buffer);
callbackResponse processProvisionResponse(const callbackData &data);
void startup();
bool wifiKeeperEnable();
void wifiKeeperDisable();
void wifiKeeperCb();
void udawa();
void serialWriteToCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc, bool isRpc);
void serialReadFromCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc);
void syncConfigCoMCU();
void readSettings(StaticJsonDocument<DOCSIZE> &doc,const char* path);
void writeSettings(StaticJsonDocument<DOCSIZE> &doc, const char* path);
void setCoMCUPin(uint8_t pin, uint8_t op, uint8_t mode, uint16_t aval, uint8_t state);
void rtcUpdate(long ts = 0);
void setBuzzer(int32_t beepCount, uint16_t beepDelay);
void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay);
void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay);
void emitAlarm(int code);
void cbSubscribe(const GenericCallback *callbacks, size_t callbacksSize);
void runCb(const char *methodName, JsonObject &params);
#ifdef USE_WEB_IFACE
void onWsEventCb(uint8_t num, WStype_t type, uint8_t * payload, size_t length);
#endif
bool ifaceLoopEnable();
void ifaceLoopCb();
void ifaceLoopDisable();
bool wifiOtaEnable();
void wifiOtaLoopCb();
void wifiOtaDisable();
void tbLoopCb();
void tbLoopDisable();
bool tbKeeperEnable();
void tbKeeperCb();
void tbKeeperDisable();
void tbKeeperProvCb();
void updateSpiffsCb();
void webSendFile(String path, String type);

ESP32SerialLogger serial_logger;
ESP32UDPLogger udp_logger;
LogManager *log_manager = LogManager::GetInstance(LogLevel::VERBOSE);
WiFiClientSecure ssl = WiFiClientSecure();
WiFiMulti wifiMulti;
Config config;
ConfigCoMCU configcomcu;
ThingsBoardSized<DOCSIZE_MIN, 64, LogManager> tb(ssl);
ESP32Time rtc(0);
GCB m_gcb[10];
Scheduler r;
#ifdef USE_WEB_IFACE
WebServer web(80);
WebSocketsServer ws = WebSocketsServer(81);
#endif

Task wifiKeeperLoop(INTV_wifiKeeperLoop, TASK_FOREVER, &wifiKeeperCb, &r, 0, &wifiKeeperEnable, &wifiKeeperDisable, 0);
Task tbKeeperLoop(INTV_tbKeeperLoop, TASK_FOREVER, &tbKeeperCb, &r, 0, &tbKeeperEnable, &tbKeeperDisable, 0);
Task ifaceLoop(INTV_ifaceLoop, TASK_FOREVER, &ifaceLoopCb, &r, 0, &ifaceLoopEnable, &ifaceLoopDisable, 0);
Task tbLoop(INTV_tbLoop, TASK_FOREVER, &tbLoopCb, &r, 0, NULL, &tbLoopDisable, 0);
Task wifiOtaLoop(INTV_wifiOtaLoop, TASK_FOREVER, &wifiOtaLoopCb, &r, 0, &wifiOtaEnable, &wifiOtaDisable, 0);
Task updateSpiffs(TASK_IMMEDIATE, TASK_ONCE, &updateSpiffsCb, &r, 0, NULL, NULL, 0);

