Narin-Laboratory/libudawa-esp32/src/libudawa.h
void startup() {
  // put your setup code here, to run once:
  Serial.begin(115200);

  config.logLev = 1;
  log_manager->add_logger(&serial_logger);
  log_manager->add_logger(&udp_logger);
  log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);
  if(!SPIFFS.begin(true))
  {
    //configReset();
    configLoadFailSafe();
    log_manager->error(PSTR(__func__), PSTR("Problem with SPIFFS file system. Failsafe config was loaded.\n"));
  }
  else
  {
    log_manager->info(PSTR(__func__), PSTR("Loading config...\n"));
    configLoad();
    log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);
  }
  #ifdef USE_SERIAL2
    log_manager->debug(PSTR(__func__), PSTR("Serial 2 - CoMCU Activated!\n"));
    Serial2.begin(115200, SERIAL_8N1, S2_RX, S2_TX);
  #endif

  log_manager->debug(PSTR(__func__), PSTR("Startup time: %s\n"), rtc.getDateTime().c_str());

  wifiKeeperLoop.enable();
  setAlarm(0, 0, 3, 100);
}


void cbSubscribe(const GCB *callbacks, size_t callbacksSize)
{
  for (size_t i = 0; i < callbacksSize; ++i) {
    m_gcb[i] = callbacks[i];
  }
}

void runCb(const char *methodName, JsonObject &params){
  for (size_t i = 0; i < sizeof(m_gcb) / sizeof(*m_gcb); ++i) {
    if (m_gcb[i].m_cb && !strcmp(m_gcb[i].m_name, methodName)) {
      log_manager->debug(PSTR(__func__), PSTR("calling generic RPC: %s\n"), m_gcb[i].m_name);
      m_gcb[i].m_cb(params);
      break;
    }
  }
}

bool ifaceLoopEnable(){
  if(WiFi.isConnected() && config.fIface){
    #ifdef USE_WEB_IFACE
      web.on(PSTR("/"), []() { webSendFile("/www/index.html", "text/html"); });
      web.on(PSTR("/runtime.js"), []() { webSendFile("/www/runtime.js", "application/javascript"); });
      web.on(PSTR("/polyfills.js"), []() { webSendFile("/www/polyfills.js", "application/javascript"); });
      web.on(PSTR("/main.js"), []() { webSendFile("/www/main.js", "application/javascript"); });
      web.on(PSTR("/styles.css"), []() { webSendFile("/www/styles.css", "text/css"); });
      web.on(PSTR("/assets/img/udawa.svg"), []() { webSendFile("/www/assets/img/udawa.svg", "image/svg+xml"); });
      web.on(PSTR("/favicon"), []() { webSendFile("/www/favicon.ico", "image/x-icon"); });

      web.begin();

      ws.begin();
      ws.onEvent(onWsEventCb);
    #endif

    ifaceLoop.setTimeout(TASK_EXPIRED * TASK_SECOND, false);
    return true;
  }
  return false;
}

void ifaceLoopCb(){
  #ifdef USE_WEB_IFACE
    ws.loop();
    web.handleClient();
  #endif
  ifaceLoop.resetTimeout();
}

void ifaceLoopDisable(){
  if(ifaceLoop.timedOut()){
    log_manager->verbose(PSTR(__func__),PSTR("ifaceLoop has timed out. Restarting...\n"));
    ifaceLoop.setInterval(INTV_ifaceLoop);
    ifaceLoop.setIterations(TASK_FOREVER);
    ifaceLoop.enable();
  }
}

bool wifiOtaEnable(){
  if(config.fWOTA){
    ArduinoOTA.setHostname(config.hname);
    ArduinoOTA.setPasswordHash(config.upass);
    ArduinoOTA.begin();

    ArduinoOTA
      .onStart([]()
      {
        String type;
        if (ArduinoOTA.getCommand() == U_FLASH)
            type = "sketch";
        else // U_SPIFFS
            type = "filesystem";
            SPIFFS.end();
        log_manager->warn(PSTR(__func__),PSTR("Starting OTA %s\n"), type.c_str());
      })
      .onEnd([]()
      {
        log_manager->warn(PSTR(__func__),PSTR("Device rebooting...\n"));
        reboot();
      })
      .onProgress([](unsigned int progress, unsigned int total)
      {
        log_manager->warn(PSTR(__func__),PSTR("OTA progress: %d/%d\n"), progress, total);
      })
      .onError([](ota_error_t error)
      {
        log_manager->warn(PSTR(__func__),PSTR("OTA Failed: %d\n"), error);
        reboot();
      }
    );
    log_manager->verbose(PSTR(__func__),PSTR("Enabled.\n"));
    wifiOtaLoop.setTimeout(TASK_EXPIRED * TASK_SECOND, false);
    return true;
  }
  return false;
}

void wifiOtaLoopCb(){
  ArduinoOTA.handle();
  wifiOtaLoop.resetTimeout();
}

void wifiOtaDisable(){
  if(wifiOtaLoop.timedOut()){
    log_manager->verbose(PSTR(__func__),PSTR("wifiOtaLoop has timed out. Restarting...\n"));
    wifiOtaLoop.setInterval(INTV_wifiOtaLoop);
    wifiOtaLoop.setIterations(TASK_FOREVER);
    wifiOtaLoop.enable();
  }
  ArduinoOTA.end();
  log_manager->verbose(PSTR(__func__),PSTR("Disabled.\n"));
}

void tbLoopCb(){
  tb.loop();
}
void tbLoopDisable(){
  tb.disconnect();
  log_manager->verbose(PSTR(__func__),PSTR("Disabled.\n"));
}

bool tbKeeperEnable(){
  if(!config.fIoT){
    return false;
  }

  int freeHeap = ESP.getFreeHeap();
  log_manager->info(PSTR(__func__),PSTR("Initializing IoT, available memory: %d\n"), freeHeap);
  if(freeHeap < 92000)
  {
    log_manager->warn(PSTR(__func__),PSTR("Unable to init IoT, insufficient memory: %d\n"), freeHeap);
    return false;
  }

  if(!WiFi.isConnected()){
    log_manager->warn(PSTR(__func__),PSTR("Unable to init IoT, WiFi is not connected!\n"));
    return false;
  }

  log_manager->verbose(PSTR(__func__),PSTR("tbBuffSize: %d, tbSocketTimeout: %d, tbKeepAlive: %d.\n"), tb.getBufferSize(), tb.getSocketTimeout(), tb.getKeepAlive());

  tbKeeperLoop.setTimeout(TASK_EXPIRED * TASK_SECOND, false);
  tb.setBufferSize(DOCSIZE_MIN);
  tb.setSocketTimeout(3);
  tb.setKeepAlive(10);
  tbLoop.setInterval(INTV_tbLoop);
  tbLoop.setIterations(TASK_FOREVER);
  tbLoop.enable();

  log_manager->verbose(PSTR(__func__),PSTR("Enabled.\n"));
  return true;
}
void tbKeeperCb(){
  log_manager->verbose(PSTR(__func__), PSTR("Overrun: %d, start delayed by: %d\n"), wifiKeeperLoop.getOverrun(), wifiKeeperLoop.getStartDelay());
  if(!config.provSent)
  {
    tbKeeperLoop.resetTimeout();
    tbKeeperLoop.setCallback(tbKeeperProvCb);
    tbKeeperLoop.forceNextIteration();
  }
  else{
    if(!tb.connected())
    {
      log_manager->info(PSTR(__func__),PSTR("Connecting to broker %s:%d\n"), config.broker, config.port);
      if(!tb.connect(config.broker, config.accTkn, config.port, config.name))
      {
        config.tbDisco++;
        log_manager->warn(PSTR(__func__),PSTR("Failed to connect to IoT Broker %s (%d)\n"), config.broker, config.tbDisco);
        StaticJsonDocument<1> doc;
        JsonObject params = doc.template as<JsonObject>();
        runCb("onTbDisconnected", params);
        if(config.tbDisco >= 10){
          config.provSent = 0;
          config.tbDisco = 0;
        }
        tbKeeperLoop.resetTimeout();
        return;
      }
      StaticJsonDocument<1> doc;
      JsonObject params = doc.template as<JsonObject>();
      runCb("onTbConnected", params);
      setAlarm(0, 0, 3, 100);
      log_manager->info(PSTR(__func__),PSTR("IoT Connected!\n"));
    }
  }
  tbKeeperLoop.resetTimeout();
}

void tbKeeperProvCb(){
  log_manager->info(PSTR(__func__),PSTR("Starting provision initiation to %s:%d\n"),  config.broker, config.port);
  if(tb.connect(config.broker, "provision", config.port))
  {
    log_manager->info(PSTR(__func__),PSTR("Connected to provisioning server: %s:%d\n"),  config.broker, config.port);

