Narin-Laboratory/libudawa-esp32/src/libudawa.h
    GenericCallback cb[2] = {
      { "provisionResponse", processProvisionResponse },
      { "provisionResponse", processProvisionResponse }
    };
    if(tb.callbackSubscribe(cb, 2))
    {
      if(tb.sendProvisionRequest(config.name, config.provDK, config.provDS))
      {
        log_manager->info(PSTR(__func__),PSTR("Provision request was sent! Waiting for response.\n"));
      }
    }
  }
  else
  {
    log_manager->warn(PSTR(__func__),PSTR("Failed to connect to provisioning server: %s:%d\n"),  config.broker, config.port);
    return;
  }
}

void tbKeeperDisable(){
  if(tbKeeperLoop.timedOut()){
    log_manager->verbose(PSTR(__func__),PSTR("tbKeeperLoop has timed out. Restarting...\n"));
    tbKeeperLoop.setInterval(INTV_tbKeeperLoop);
    tbKeeperLoop.setIterations(TASK_FOREVER);
    tbKeeperLoop.enable();
  }
  tbLoop.disable();
  log_manager->verbose(PSTR(__func__),PSTR("Disabled.\n"));
}

void emitAlarm(int code){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["alarm"] = code;
  tb.sendTelemetryDoc(doc);
  log_manager->error(PSTR(__func__), PSTR("%i\n"), code);
  JsonObject params = doc.template as<JsonObject>();
  runCb("emitAlarmWs", params);
}

void rtcUpdate(long ts){
  if(ts == 0){
    configTime(config.gmtOff, 0, "pool.ntp.org");
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)){
      rtc.setTimeStruct(timeinfo);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via NTP: %s GMT Offset:%d (%d) \n"), rtc.getDateTime().c_str(), config.gmtOff, config.gmtOff / 3600);
    }
  }else{
      rtc.setTime(ts);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via timestamp: %s\n"), rtc.getDateTime().c_str());
  }
}

void cbWifiOnConnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->info(PSTR(__func__),PSTR("WiFi Connected to %s\n"), WiFi.SSID().c_str());
}

void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s and %s) Disconnected!\n"), config.wssid, config.dssid);
  if(config.fIoT){
    tbKeeperLoop.disable();
  }
  if(config.fIface){
    ifaceLoop.disable();
  }
  if(config.fWOTA){
    wifiOtaLoop.disable();
  }
}

void cbWiFiOnLostIp(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s) IP Lost!\n"), WiFi.SSID().c_str());
}

void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info)
{
  IPAddress ip = WiFi.localIP();
  char ipa[25];
  sprintf(ipa, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s) IP Assigned: %s!\n"), WiFi.SSID().c_str(), ipa);

  ssl.setCACert(CA_CERT);

  MDNS.begin(config.hname);
  MDNS.addService("http", "tcp", 80);
  log_manager->info(PSTR(__func__),PSTR("Started MDNS on %s\n"), config.hname);

  rtcUpdate(0);
  if(config.fWOTA){
    wifiOtaLoop.enable();
  }

  if(config.fIface){
    ifaceLoop.enable();
  }

  if(config.fIoT){
    tbKeeperLoop.enable();
  }

  setAlarm(0, 0, 3, 100);
}

bool wifiKeeperEnable()
{
  log_manager->debug(PSTR(__func__),PSTR("Initializing wifi network...\n"));
  WiFi.mode(WIFI_STA);
  WiFi.setHostname(config.hname);
  WiFi.setAutoReconnect(true);
  if(!config.wssid || *config.wssid == 0x00 || strlen(config.wssid) > 32)
  {
    configLoadFailSafe();
    log_manager->warn(PSTR(__func__), PSTR("SSID too long or missing! Failsafe config was loaded.\n"));
  }
  wifiMulti.addAP(config.wssid, config.wpass);
  wifiMulti.addAP(config.dssid, config.dpass);

  WiFi.onEvent(cbWifiOnConnected, ARDUINO_EVENT_WIFI_STA_CONNECTED);
  WiFi.onEvent(cbWiFiOnDisconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
  WiFi.onEvent(cbWiFiOnLostIp, ARDUINO_EVENT_WIFI_STA_LOST_IP);
  WiFi.onEvent(cbWiFiOnGotIp, ARDUINO_EVENT_WIFI_STA_GOT_IP);

  log_manager->verbose(PSTR(__func__),PSTR("Enabled.\n"));
  wifiKeeperLoop.setTimeout(TASK_EXPIRED * TASK_SECOND, false);
  return true;
}

void wifiKeeperCb(){
  log_manager->verbose(PSTR(__func__), PSTR("Overrun: %d, start delayed by: %d\n"), wifiKeeperLoop.getOverrun(), wifiKeeperLoop.getStartDelay());
  wifiMulti.run();
  wifiKeeperLoop.resetTimeout();
}

void wifiKeeperDisable(){
  if(wifiKeeperLoop.timedOut()){
    log_manager->verbose(PSTR(__func__),PSTR("wifiKeeperLoop has timed out. Restarting...\n"));
    wifiKeeperLoop.setInterval(INTV_wifiKeeperLoop);
    wifiKeeperLoop.setIterations(TASK_FOREVER);
    wifiKeeperLoop.enable();
  }
}

#ifdef USE_WEB_IFACE
void onWsEventCb(uint8_t num, WStype_t type, uint8_t * payload, size_t length){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  DeserializationError err = deserializeJson(doc, payload);

  switch(type) {
    case WStype_DISCONNECTED:
      {
        config.wsCount--;
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] disconnect\n"), num);
        doc["evType"] = (int)WStype_DISCONNECTED;
        JsonObject root = doc.template as<JsonObject>();
        runCb("wsEvent", root);
      }
      break;
    case WStype_CONNECTED:
      {
        config.wsCount++;
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] connect\n"), num);
        doc["evType"] = (int)WStype_CONNECTED;
        JsonObject root = doc.template as<JsonObject>();
        runCb("wsEvent", root);
      }
      break;
    case WStype_TEXT:
      {
        if (err == DeserializationError::Ok)
        {
          doc["evType"] = (int)WStype_TEXT;
          JsonObject root = doc.template as<JsonObject>();
          log_manager->debug(PSTR(__func__), PSTR("WS message parsing %s\n"), err.c_str());
          runCb("wsEvent", root);
        }
        else
        {
          log_manager->warn(PSTR(__func__), PSTR("WS message parsing error: %s\n"), err.c_str());
        }
      }
      break;
    case WStype_BIN:
      {

      }
      break;
    case WStype_ERROR:
      {
        log_manager->warn(PSTR(__func__), PSTR("ws [%u] error\n"), num);
        doc["evType"] = (int)WStype_ERROR;
        JsonObject root = doc.template as<JsonObject>();
        runCb("wsEvent", root);
      }
      break;			
    case WStype_FRAGMENT_TEXT_START:
    case WStype_FRAGMENT_BIN_START:
    case WStype_FRAGMENT:
    case WStype_FRAGMENT_FIN:
      break;
  }
}
#endif

void udawa() {
  r.execute();
}

void updateSpiffsCb(){
  esp32FOTA esp32FOTA(CURRENT_FIRMWARE_TITLE, CURRENT_FIRMWARE_VERSION);

  CryptoMemAsset  *MyRootCA = new CryptoMemAsset("Root CA", CA_CERT, strlen(CA_CERT)+1 );

  esp32FOTA.setManifestURL(mnfstUrl);
  esp32FOTA.setRootCA(MyRootCA);
  esp32FOTA.setCertFileSystem(nullptr);
  esp32FOTA.setProgressCb( [](size_t progress, size_t size) {
      if( progress == size || progress == 0 ) Serial.println();
      Serial.print(".");
  });
  esp32FOTA.setUpdateCheckFailCb( [](int partition, int error_code) {
    Serial.printf("Update could validate %s partition (error %d)\n", partition==U_SPIFFS ? "spiffs" : "firmware", error_code );
    // error codes:
    //  -1 : partition not found
    //  -2 : validation (signature check) failed
  });
  esp32FOTA.setUpdateBeginFailCb( [](int partition) {

  });
  esp32FOTA.setUpdateEndCb( [](int partition) {

  });
  esp32FOTA.setUpdateFinishedCb( [](int partition, bool restart_after) {
    StaticJsonDocument<1> doc;
    doc["partition"] = partition;
    JsonObject root = doc.template as<JsonObject>();
    configSave();
    configCoMCUSave();
    runCb("onUpdateFinished", root);
  });

