Narin-Laboratory/libudawa-esp32/src/libudawa.h
const uint32_t MAX_INT = 0xFFFFFFFF;
uint32_t micro2milli(uint32_t hi, uint32_t lo)
{
  if (hi >= 1000)
  {
    log_manager->warn(PSTR(__func__), PSTR("Cannot store milliseconds in uint32!\n"));
  }

  uint32_t r = (lo >> 16) + (hi << 16);
  uint32_t ans = r / 1000;
  r = ((r % 1000) << 16) + (lo & 0xFFFF);
  ans = (ans << 16) + r / 1000;

  return ans;
}


static SemaphoreHandle_t udpSemaphore = NULL;
void ESP32UDPLogger::log_message(const char *tag, LogLevel level, const char *fmt, va_list args)
{
    if((int)level > config.logLev || !WiFi.isConnected()){
      return;
    }
    if(udpSemaphore == NULL)
    {
        udpSemaphore = xSemaphoreCreateMutex();
    }

    if(udpSemaphore != NULL && xSemaphoreTake(udpSemaphore, (TickType_t) 20))
    {
        int size = 1024;
        WiFiUDP udp;
        char data[size];
        vsnprintf(data, size, fmt, args);
        String msg = String(get_error_char(level)) + "~[" + config.name + "] " + String(tag) + "~" + String(data);
        
        udp.beginPacket(config.logIP, config.logPrt);
        udp.write((uint8_t*)msg.c_str(), msg.length());
        udp.endPacket();

        xSemaphoreGive(udpSemaphore);
    }
    else{
        printf("Could not get UDP semaphore.\n");
    }
}

void webSendFile(String path, String type){
  File file = SPIFFS.open(path.c_str(), FILE_READ);
  if(file){
    web.streamFile(file, type.c_str(), 200);
  }else{
    web.send(503, PSTR("text/plain"), PSTR("Server error."));
  }
  file.close();
}

} // namespace libudawa
#endif